-- phpMyAdmin SQL Dump
-- version 4.8.5
-- https://www.phpmyadmin.net/
--
-- Host: localhost:8889
-- Generation Time: May 11, 2020 at 07:14 AM
-- Server version: 5.7.25
-- PHP Version: 7.3.1

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";

--
-- Database: `muef`
--

-- --------------------------------------------------------

--
-- Table structure for table `allstudent`
--

CREATE TABLE `allstudent` (
  `stdId` int(255) NOT NULL,
  `fname` text,
  `lname` text,
  `nname` text,
  `gender` text,
  `birthday` text,
  `salary` text,
  `stdCode` text,
  `stdRoom` text,
  `schoolname` text,
  `region` text,
  `district` text,
  `province` text,
  `create_time` timestamp(6) NOT NULL DEFAULT CURRENT_TIMESTAMP(6),
  `codeId` text,
  `user` text
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `allstudent`
--

INSERT INTO `allstudent` (`stdId`, `fname`, `lname`, `nname`, `gender`, `birthday`, `salary`, `stdCode`, `stdRoom`, `schoolname`, `region`, `district`, `province`, `create_time`, `codeId`, `user`) VALUES
(38, 'test', 'test', 'test', 'male', 'Tue Oct 17 2017 00:00:00 GMT+0700 (Indochina Time)', 'มากกว่า 30,000 บาท/เดือน', 'test', 'test', 'test', 'test', 'test', 'กาญจนบุรี', '2020-05-08 14:17:16.036570', '2020582135ZYgzMes9Ub', 'warawat'),
(39, 'test', 'test', 'test', 'female', 'Wed Aug 16 2017 00:00:00 GMT+0700 (Indochina Time)', 'มากกว่า 30,000 บาท/เดือน', 'test', 'test', 'test', 'test', 'test', 'กาญจนบุรี', '2020-05-08 14:18:32.943065', '20205821942xRG3ZjOx5q', 'warawat'),
(46, 'test', 'test', 'test', 'female', 'Wed Aug 16 2017 00:00:00 GMT+0700 (Indochina Time)', 'มากกว่า 30,000 บาท/เดือน', 'test', 'test', 'test', 'test', 'test', 'กรุงเทพมหานคร', '2020-05-10 11:09:18.658391', '202001018656UIgPbvzkHy', 'warawat'),
(47, 'aaa', 'aaa', 'aaa', 'male', 'Wed Oct 18 2017 00:00:00 GMT+0700 (Indochina Time)', 'มากกว่า 30,000 บาท/เดือน', 'aaa', 'aaa', 'aaa', 'aaa', 'aaa', 'กรุงเทพมหานคร', '2020-05-10 11:20:56.871081', '2020010188695KOwedS1R8', 'warawat'),
(48, 'q', 'q', 'q', 'male', 'Mon Apr 09 2018 00:00:00 GMT+0700 (Indochina Time)', 'มากกว่า 30,000 บาท/เดือน', 'test', 'test', 'test', 'test', 'test', 'กรุงเทพมหานคร', '2020-05-10 12:06:49.267398', '202001019264GlX7uAugat', 'warawat'),
(49, 'ttt', 'ttt', 'ttt', 'female', 'Wed May 10 2017 00:00:00 GMT+0700 (Indochina Time)', 'มากกว่า 30,000 บาท/เดือน', 'ttt', 'ttt', 'ttt', 'ttt', 'ttt', 'กรุงเทพมหานคร', '2020-05-10 14:28:21.040999', '20200102140mGHoPvkSXf', 'warawat'),
(50, 'zzzz', 'zzzz', 'zzzz', 'male', 'Wed May 11 2016 00:00:00 GMT+0700 (Indochina Time)', 'มากกว่า 30,000 บาท/เดือน', 'zzz', 'zzz', 'zzz', 'zzz', 'zzz', 'กรุงเทพมหานคร', '2020-05-10 19:23:45.056973', '2020111255HBUrIO7hAu', 'warawat');

-- --------------------------------------------------------

--
-- Table structure for table `EC`
--

CREATE TABLE `EC` (
  `id` int(255) NOT NULL,
  `question` text NOT NULL,
  `toolips` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `EC`
--

INSERT INTO `EC` (`id`, `question`, `toolips`) VALUES
(1, 'เมื่อเจอปัญหา สงบสติอารมณ์หาทางแก้ปัญหาไม่เอาแต่โวยวาย', 'รู้จักควบคุมอารมณ์ คิดหาทางแก้ปัญหาไม่เอะอะโวยวายเมื่อเจอเหตุการณ์ที่ทำให้หงุดหงิดเช่น เมื่อถูกเพื่อนแย่งของเล่น เมื่อถูกเพื่อนแกล้ง หรือเมื่อหาของใช้ไม่เจอ'),
(2, 'เมื่อโกรธรู้จักสงบอารมณ์ระบายอารมณ์โกรธอย่างเหมาะสม  ไม่ใช้ความรุนแรงเช่น ไปเล่นกีฬา เล่นดนตรี วาดภาพ ฯลฯ', 'เมื่อโกรธ รู้จักค่อยๆสงบสติอารมณ์ ระบายความโกรธให้ผ่อนคลายลงโดยไม่ต้องใช้ความรุนแรง'),
(3, 'อารมณ์มั่นคง ไม่แปรปรวนง่าย', 'ควบคุมอารมณ์ให้มั่นคง ไม่หงุดหงิดโมโหมากไป แม้อยู่ในสถานการณ์ที่กดดัน จนผ่านพ้นสถานการณ์นั้นไปได้'),
(4, 'ระงับอารมณ์ตื่นเต้นวิตกกังวลเพื่อทำกิจกรรมต่อได้ เช่นเมื่อทำของหาย เมื่อต้องออกไปพูดหน้าชั้นเรียน', 'สามารถระงับความตื่นเต้นกังวล ไม่ให้มากเกินไป จนทำอะไรไม่ได้ เช่น ระงับความตื่นเต้นได้เมื่อต้องออกไปพูดหน้าชั้นเรียน'),
(5, 'เมื่อผิดหวังเสียใจ ครูปลอบโยนให้คืนอารมณ์เป็นปกติได้ในเวลาไม่นาน (3 ขวบไม่เกิน 5 นาที, 5 ขวบไม่เกิน 10นาที)', 'เมื่อเสียใจ เด็กสามารถค่อยๆคืนอารมณ์ให้เป็นปกติได้ในเวลาที่เหมาะสมตามวัย เมื่อครูปลอบโยนสักครู่หนึ่ง เด็กกลับไปเล่นกับเพื่อนได้ตามปกติหรือพูดคุยได้ตามปกติ');

-- --------------------------------------------------------

--
-- Table structure for table `INH`
--

CREATE TABLE `INH` (
  `id` int(255) NOT NULL,
  `question` text NOT NULL,
  `toolips` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `INH`
--

INSERT INTO `INH` (`id`, `question`, `toolips`) VALUES
(1, 'ตั้งใจทำกิจกรรมของตัวเอง ไม่รบกวนผู้อื่น', 'รู้จักหยุดทำเสียงดัง หยุดแหย่เพื่อน หยุดชวนเพื่อนคุย หยุดเดินไปมาในชั้นเรียน ในขณะทำกิจกรรมที่ครูมอบหมาย เช่น วาดรูป ระบายสี ปั้นดินน้ำมัน ฯลฯ'),
(2, 'เมื่อขัดแย้งกับเพื่อน ไม่ใช้กำลังในการแก้ปัญหา', 'รู้จักหยุด ไม่ใช้กำลังเมื่อขัดแย้งกับเพื่อน แต่รู้จักคิดวิธีแก้ปัญหาโดยไม่ใช้ความรุนแรง เช่น เมื่อถูกเพื่อนแกล้งรู้จักให้อภัยไม่ตีเพื่อนกลับในทันที   เมื่อถูกเพื่อนแย่งของเล่น รู้จักตกลงแบ่งกันเล่น ไม่ทะเลาะกัน'),
(3, 'จดจ่อกับกิจกรรมในชั้นเรียนที่ครูสอน', 'รู้จักหยุด ไม่สนใจสิ่งที่มากวนให้เสียสมาธิ เพื่อจดจ่อกับกิจกรรมในชั้นเรียน เช่น จดจ่อฟังนิทานที่ครูเล่า หรือจดจ่อกับการวาดภาพ'),
(4, 'ทำกิจกรรมที่ครูมอบหมายเสร็จในเวลาที่กำหนด', 'รู้จักหยุดทำสิ่งที่ไม่เกี่ยวข้องเพื่อทำงานที่ครูมอบหมายให้เสร็จ เช่น หยุดคุย หยุดเล่น ฯลฯ ตั้งใจทำงาน'),
(5, 'เข้าคิวรอได้ อดทนรอคอยได้', 'รู้จักหยุดรอให้ถึงคิวของตัวเอง เช่น เข้าคิวรับขนม อาหาร รอคิวเข้าห้องน้ำ ฯลฯ'),
(6, 'รู้จักรอที่จะพูด ไม่พูดแทรกในขณะที่ผู้อื่นกำลังพูด', 'รู้จักหยุดฟังครูพูด ไม่พูดแทรก หรือหยุดรอให้ผู้ใหญ่คุยกันเสร็จก่อนแล้วจึงค่อยพูด'),
(7, 'เมื่อต้องการของที่เพื่อนกำลังเล่นอยู่ รู้จักขออนุญาตหรือรอให้เพื่อนเล่นเสร็จก่อน', 'รู้จักหยุดรอให้เพื่อนเล่นเสร็จก่อน หรือเข้าไปขอเล่นด้วย ไม่แย่งของเล่นทันที'),
(8, 'หยุดเล่นเสียงดังเมื่อครูเตือน', 'รู้จักหยุดเล่นเสียงดังหรือลดเสียงให้เบาลงเมื่อครูเตือน'),
(9, 'จดจ่อกับงานที่ทำ ไม่วอกแวกง่าย', 'รู้จักหยุด ไม่สนใจสิ่งที่มากวนให้เสียสมาธิเพื่อจดจ่อกับกิจกรรมในชั้นเรียน แม้สิ่งแวดล้อมจะดังจอแจ'),
(10, 'เล่นอย่างระวัง รู้จักหยุดเมื่อเห็นว่าการเล่นแรงขึ้นจนอาจบาดเจ็บหรือเกิดอันตราย', 'รู้จักหยุดเล่นแรงๆ หรือเล่นให้เบาลงได้เมื่อครูเตือน รู้จักระมัดระวังเมื่อการเล่นแรงจนอาจเกิดอันตราย');

-- --------------------------------------------------------

--
-- Table structure for table `PO`
--

CREATE TABLE `PO` (
  `id` int(255) NOT NULL,
  `question` text NOT NULL,
  `toolips` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `PO`
--

INSERT INTO `PO` (`id`, `question`, `toolips`) VALUES
(1, 'เก็บของเล่นเข้าที่เมื่อเล่นเสร็จ ไม่ทิ้งเกลื่อนกลาด', 'จัดการงานให้สร็จได้ด้วยตัวเองโดยไม่ต้องบอก เช่น เก็บของเล่นเข้าที่เมื่อเล่นเสร็จ'),
(2, 'เมื่อครูชี้แนะให้ทำงาน เด็กเริ่มต้นลงมือทำงานที่ได้รับมอบหมายได้ด้วยตนเอง โดยไม่ต้องคอยเตือน', 'เริ่มต้นทำงานได้เองจนเสร็จ โดยไม่ต้องมีครูคอยเตือน หรือคอยกำกับ เมื่อครูอธิบายวิธีทำกิจกรรมตามวัยของเด็ก เช่น ปั้นดิน วาดภาพระบายสี ประดิษฐ์สิ่งของจากวัสดุเหลือใช้ เด็กเริ่มต้นลงมือทำและทำจนเสร็จได้'),
(3, 'เมื่อบอกตำแหน่งที่ตั้งของสิ่งของบางอย่างในห้องอย่างชัดเจน  เด็กสามารถหาของนั้นเจอ', 'เข้าใจลำดับคำสั่งที่ครูบอกและปฎิบัติตามได้ เช่น เมื่อครูบอกเด็กว่าให้ไปหยิบยางลบดินสอในลิ้นชักโต๊ะหลังห้อง  หรือ หยิบดินน้ำมันกับลูกบอลในตะกร้า ฯลฯ แล้วนำมาให้ครู เด็กสามารถทำตามได้'),
(4, 'รู้ว่าเวลาไหนต้องทำอะไรเช่น เข้าแถวเมื่อได้ยินเสียงกริ่ง ล้างมือก่อนทานอาหาร เก็บของก่อนกลับบ้าน', 'รู้ว่าเวลาไหนต้องทำอะไร เข้าใจสัญญาณบอกเวลาเพื่อทำกิจกรรมตามตารางเวลาได้ เช่น เข้าแถวเมื่อได้ยินเสียงกริ่ง  เก็บของเล่นเมื่อครูร้องเพลงรอ เตรียมเก็บของใช้ใส่กระเป๋าเมื่อถึงเวลาเลิกเรียน เป็นต้น'),
(5, 'รู้จักแก้ปัญหาเช่น เมื่อทำน้ำหกรู้จักหาผ้ามาเช็ด เมื่อต้องการของเล่นที่เอื้อมไม่ถึงรู้จักหาเก้าอี้หรือบันไดเตี้ยมาปีนหยิบของ เมื่อไม่มีช้อนทานข้าวรู้จักเดินไปหยิบ ไม่มียางลบรู้จักเดินไปหา', 'สามารถแก้ปัญหาง่ายๆด้วยตนเองได้ เช่น เมื่อทำน้ำหกรู้จักเอาผ้ามาเช็ด  เมื่อหยิบของเล่นไม่ถึงรู้จักเอาเก้าอี้หรือบันไดมาปีนหยิบ เป็นต้น'),
(6, 'ทำงานเสร็จโดยไม่ติดกับรายละเอียดเล็กน้อยที่ไม่สำคัญมากเกินไปเช่น ต่อเลโก้จนเสร็จแม้จะหาบางชิ้นไม่เจอก็ใช้ชิ้นอื่นหรือสีอื่นแทน ลากเส้นผิดแต่ไม่มียางลบก็ทำต่อจนเสร็จได้', 'รู้จักมองข้ามปัญหาเล็กน้อยที่ไม่สำคัญไปได้โดยมองภาพรวมของงานหาทางแก้ปัญหา เช่น หาสิ่งอื่นมาทดแทนเพื่อให้งานเสร็จ');

-- --------------------------------------------------------

--
-- Table structure for table `SHF`
--

CREATE TABLE `SHF` (
  `id` int(255) NOT NULL,
  `question` text NOT NULL,
  `toolips` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `SHF`
--

INSERT INTO `SHF` (`id`, `question`, `toolips`) VALUES
(1, 'เปลี่ยนกิจกรรมตามตารางแต่ละช่วงของวันได้โดยไม่มีปัญหา', 'สามารถปฏิบัติตามตารางกิจกรรมประจำวัน เปลี่ยนกิจกรรมได้เมื่อถึงเวลา โดยไม่ต่อต้านหรือร้องไห้งอแง'),
(2, 'ปรับตัวเข้ากับสถานที่ใหม่ได้โดยใช้เวลาไม่นานนัก', 'เมื่อต้องไปในสถานที่ใหม่ที่ไม่คุ้นเคย สามารถปรับตัวเข้ากับสถานที่ใหม่ได้โดยไม่มีปัญหาไม่หงุดหงิดงอแง'),
(3, 'ปรับตัวเข้ากับครูคนใหม่ เพื่อนใหม่ ได้โดยใช้เวลาไม่นานนัก', 'เมื่อย้ายห้องเรียน เปลี่ยนครูหรือเพื่อนคนใหม่ สามารถปรับตัวเข้ากับครูหรือเพื่อนใหม่ได้ในเวลาไม่นานนัก'),
(4, 'เมื่อถูกเพื่อนปฏิเสธที่จะเล่นด้วยหรือถูกแย่งของเล่นเด็กสามารถเปลี่ยนไปเล่นอย่างอื่นโดยไม่หงุดหงิด', 'เมื่อเพื่อนไม่เล่นด้วย หรือถูกเพื่อนแย่งของเล่น สามารถเปลี่ยนไปเล่นอย่างอื่น หรือเปลี่ยนไปเล่นกับเพื่อนคนอื่นได้โดยไม่หงุดหงิด งอแง'),
(5, 'ทำกิจกรรมต่อไปได้ แม้สิ่งแวดล้อมจะวุ่นวายจ้อกแจ้กจอแจ', 'เปลี่ยนความสนใจมาจดจ่ออยู่กับกิจกรรมที่ทำได้แม้จะอยู่ในสิ่งแวดล้อมที่วุ่นวาย เช่น เมื่อมีคนคุยกันเสียงดังอยู่นอกห้อง เด็กอาจจะหันไปมอง แต่ดึงความสนใจกลับมาจดจ่อทำงานต่อไปได้');

-- --------------------------------------------------------

--
-- Table structure for table `test_result`
--

CREATE TABLE `test_result` (
  `id` int(255) NOT NULL,
  `codeId` text,
  `INH` int(255) DEFAULT NULL,
  `SHF` int(255) DEFAULT NULL,
  `EC` int(255) DEFAULT NULL,
  `WM` int(255) DEFAULT NULL,
  `PO` int(255) DEFAULT NULL,
  `total` int(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `test_result`
--

INSERT INTO `test_result` (`id`, `codeId`, `INH`, `SHF`, `EC`, `WM`, `PO`, `total`) VALUES
(7, '2020582135ZYgzMes9Ub', 40, 20, 20, 24, 24, 128),
(8, '20205821942xRG3ZjOx5q', 25, 19, 15, 19, 16, 94),
(9, '2020010188695KOwedS1R8', 29, 0, 14, 11, 15, 69),
(10, '202001019264GlX7uAugat', 40, 15, 14, 23, 21, 113),
(11, '20200102140mGHoPvkSXf', 40, 17, 19, 17, 20, 113),
(12, '202001018656UIgPbvzkHy', 40, 20, 20, 24, 24, 128),
(13, '2020111255HBUrIO7hAu', 0, 20, 0, 24, 24, 68);

-- --------------------------------------------------------

--
-- Table structure for table `user`
--

CREATE TABLE `user` (
  `id` int(255) NOT NULL,
  `fname` text NOT NULL,
  `lname` text NOT NULL,
  `username` text NOT NULL,
  `password` text NOT NULL,
  `created` timestamp(6) NOT NULL DEFAULT CURRENT_TIMESTAMP(6),
  `salt` text
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `user`
--

INSERT INTO `user` (`id`, `fname`, `lname`, `username`, `password`, `created`, `salt`) VALUES
(1, 'warawat', 'lailerd', 'poomwarawat', '11111111', '2020-05-05 17:00:00.000000', NULL),
(20, 'วรวัชร', 'ไล้เลิศ', 'warawat', '1bbd886460827015e5d605ed44252251', '2020-05-08 13:21:04.937522', '2f13aca3fcf7722ed93f423cfa9766fd');

-- --------------------------------------------------------

--
-- Table structure for table `WM`
--

CREATE TABLE `WM` (
  `id` int(255) NOT NULL,
  `question` text NOT NULL,
  `toolips` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `WM`
--

INSERT INTO `WM` (`id`, `question`, `toolips`) VALUES
(1, 'เมื่อสั่งงานสองหรือสามอย่างตามวัย เด็กจำได้และปฏิบัติตามได้ถูกต้องครบถ้วน', 'เมื่อครูสั่งงานสองหรือสามอย่างเด็กจำคำสั่งได้ครบและปฏิบัติได้ถูกต้อง  เช่น หยิบแก้วน้ำและผ้าเช็ดโต๊ะมาให้ครู, หยิบดินน้ำมันสีแดงและสีเขียวใส่ตะกร้ามาให้ครู'),
(2, 'ทำกิจกรรมที่มีหลายขั้นตอนได้เองจนเสร็จโดยไม่มีต้องให้ครูคอยกำกับเช่น เก็บของเล่นจนเสร็จ ต่อจิ๊กซอว์จนเสร็จ (จำนวนชิ้นตามวัย: 3 ขวบ 6 ชิ้น, 4 ขวบ 8 ชิ้น, 5 ขวบ 10 ชิ้น)', 'จำขั้นตอนในการทำกิจกรรมตามลำดับได้ และทำจนเสร็จด้วยตัวเอง เช่นต่อจิ๊กซอว์ตั้งแต่เริ่มจนเสร็จเป็นรูป หรือ เก็บของเล่นเข้าที่ครบทุกชิ้นเมื่อเล่นเสร็จ วาดภาพระบายสีจนเสร็จ'),
(3, 'เมื่อได้รับการสอนในสิ่งที่ถูกต้องไปแล้ว จำได้และไม่ทำผิดในเรื่องเดิมซ้ำ เช่นทิ้งกล่องนมที่ดื่มแล้วลงถังขยะ เก็บจานชามเมื่อทานเสร็จ ฯลฯ', 'จำสิ่งที่ครูบอกและปฏิบัติตามได้ ไม่ทำผิดซ้ำ เช่น เมื่อครูสอนให้เก็บของเล่นเมื่อเล่นเสร็จ  ทิ้งกล่องนมที่ดื่มแล้วลงถังขยะ  ล้างมือก่อนกินข้าว เก็บจานชามเมื่อทานเสร็จ ฯลฯ เด็กจำและปฎิบัติได้ ไม่ทำผิดซ้ำ'),
(4, 'สนทนาหัวข้อเดิมได้ต่อเนื่องหรืออธิบายเรื่องราวได้จนจบเช่น เล่ากิจกรรมที่ทำกับครอบครัวในวันหยุดให้ครูฟังจนจบ', 'เด็กจำและอธิบายเรื่องราวที่พึ่งเกิดผ่านไป 1-2 วันได้อย่างต่อเนื่องจนจบ'),
(5, 'เมื่อครูเล่านิทานสั้นๆให้ฟังจบไปครู่หนึ่ง เด็กสามารถเล่าทวนหรือบอกความคิดรวบยอดเกี่ยวกับนิทานนั้นได้ (เช่น ตัวละคร ฉาก เหตุการณ์ เรื่องราว)', 'เด็กจำได้และสามารถเล่าเรื่องหรือตอบคำถามเกี่ยวกับนิทานที่ครูพึ่งเล่าจบไปสักครู่ได้ถูกต้อง'),
(6, 'มีช่วงระยะความสนใจจดจ่อตามวัย เช่น 3 ขวบจดจ่อได้นาน 3 นาที, 5 ขวบจดจ่อได้นาน 5 นาที', 'ความสนใจจดจ่อเป็นพื้นฐานสำคัญของการเกิดความจำขณะทำงาน เด็กสามารถจดจ่อทำกิจกรรมหรือเล่นของเล่นได้นาน 3-5 นาทีตามอายุ');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `allstudent`
--
ALTER TABLE `allstudent`
  ADD PRIMARY KEY (`stdId`);

--
-- Indexes for table `EC`
--
ALTER TABLE `EC`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `INH`
--
ALTER TABLE `INH`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `PO`
--
ALTER TABLE `PO`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `SHF`
--
ALTER TABLE `SHF`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `test_result`
--
ALTER TABLE `test_result`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `user`
--
ALTER TABLE `user`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `WM`
--
ALTER TABLE `WM`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `allstudent`
--
ALTER TABLE `allstudent`
  MODIFY `stdId` int(255) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=51;

--
-- AUTO_INCREMENT for table `EC`
--
ALTER TABLE `EC`
  MODIFY `id` int(255) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT for table `INH`
--
ALTER TABLE `INH`
  MODIFY `id` int(255) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=11;

--
-- AUTO_INCREMENT for table `PO`
--
ALTER TABLE `PO`
  MODIFY `id` int(255) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT for table `SHF`
--
ALTER TABLE `SHF`
  MODIFY `id` int(255) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT for table `test_result`
--
ALTER TABLE `test_result`
  MODIFY `id` int(255) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=14;

--
-- AUTO_INCREMENT for table `user`
--
ALTER TABLE `user`
  MODIFY `id` int(255) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=21;

--
-- AUTO_INCREMENT for table `WM`
--
ALTER TABLE `WM`
  MODIFY `id` int(255) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;
